# Завдання 8
#     На карантині я розпочав бігові тренування. В перший день пробіг 500 метрів.
#     Кожний наступний день дистанцію збільшую на 10%. Відомо, що карантин триває 30 днів.
    
#         - Яку дистанцію я пробіжу в останній день карантину?
        
#         - Скільки днів потрібно бігати, щоб сумарна дистанція за всі дні 
#             перевищила довжину марафону (42 км)?
i = 1
m = 500
d = 100
summ = m


while i < d:
    if i == 30: 
        print(i, "-дні-", "-км:--", summ)
        
    summ = int((m / 10) + m) 
    m = summ
    i += 1    

